challenge05/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ruby on rails"], ["description", "dio's course"], ["text", "fdsfs"], ["created_at", "2023-06-14 14:17:32.836429"], ["updated_at", "2023-06-14 14:17:32.836429"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "fdsfsgdfgdgd"], ["updated_at", "2023-06-14 14:17:44.820065"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)